src/cf/Catalogs/СегментыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СегментыНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйРежимРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СоставСегментаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставСегментаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СегментДляСписка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыДляСписка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДобавленияВСегмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СпособыДобавленияВСегмент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДобавленияВСегмент</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПравилам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СегментыНоменклатуры/Forms/ДобавлениеНоменклатурыВСегменты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивНоменклатуры = Новый Массив;
	Параметры.Свойство("МассивНоменклатуры",МассивНоменклатуры);
    ЗаполнитьПолучателей(МассивНоменклатуры);

	ЦветТекущегоШага = ЦветаСтиля.ЦветФонаПодсказки;
	ЦветШага         = ЦветаСтиля.ЦветФонаФормы;
	
	ТекущийШаг = 1;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДекорацияПодготовкаСпискаНоменклатурыНажатие(Элемент)

	ТекущийШаг = 1;
	УправлениеФормой();
	
КонецПроцедуры   

&НаКлиенте
Процедура ДекорацияВыборСегментовНоменклатурыНажатие(Элемент)
	
	ТекущийШаг = 2;
	УправлениеФормой();
	
КонецПроцедуры   

&НаКлиенте
Процедура СегментыНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборСегментаСервер(ВыбранноеЗначение);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СегментыНоменклатурыПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для Каждого Строка Из Номенклатура Цикл
		Строка.Пометка = Истина;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)

	Для Каждого Строка Из Номенклатура Цикл
		Строка.Пометка = Ложь;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходКоВторомуШагу(Команда)

	ТекущийШаг = 2;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходКПервомуШагу(Команда)

	ТекущийШаг = 1;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСегмент(Команда) 

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора", ПараметрыФормы, Элементы.СегментыНоменклатуры,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСегмент(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора", ПараметрыФормы, Элементы.СегментыНоменклатуры,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)

	Если СегментыНоменклатуры.Количество() = 0 Тогда
		Закрыть();
		Возврат;
	КонецЕсли; 
	
	КоличествоСтрокНоменклатурыСПометкой = Номенклатура.НайтиСтроки(Новый Структура("Пометка",Истина)).Количество();
	Если КоличествоСтрокНоменклатурыСПометкой = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не выбрано ни одной номенклатуры'")); 
		Возврат;
	КонецЕсли;	
	
	ВыбраныНедоступныеСегменты = Ложь;
	Для Каждого СтрокаСегмент Из СегментыНоменклатуры Цикл
		Сегмент = СтрокаСегмент.Сегмент;
		РазрешеноРедактированиеСегмента = ПроверитьДоступностьСегмента(Сегмент);
		Если РазрешеноРедактированиеСегмента <> Истина Тогда  
			ТекстШаблона = НСтр("ru = 'Сегмент %1 используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
			СтрокаШаблон = СтрШаблон(ТекстШаблона, Сегмент);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаШаблон); 
			ВыбраныНедоступныеСегменты = Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Если ВыбраныНедоступныеСегменты = Истина Тогда
		Возврат;
	КонецЕсли;    
	
	МассивОбработаноСегментов = Новый Массив;
	ДобавитьНоменклатуруВСегменты(МассивОбработаноСегментов);
	
	СтрокаИзменено = СтрокаСЧислом(
		НСтр("ru=';Добавлена номенклатура в %1 сегмент;;Добавлена номенклатура в %1 сегмента;Добавлена номенклатура в %1 сегментов;Добавлена номенклатура в %1 сегмента'"),
		Строка(МассивОбработаноСегментов.Количество()),
		ВидЧисловогоЗначения.Количественное);
		
	Если МассивОбработаноСегментов.Количество() = 1 Тогда
		СсылкаНаСегмент = ПолучитьНавигационнуюСсылку(МассивОбработаноСегментов[0]);
	КонецЕсли;
	
	Если МассивОбработаноСегментов.Количество() = 0 Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ОповещениеСпискаСегментов = Новый ОписаниеОповещения("ОткрытьСписокСегментовПоОповещению", ЭтотОбъект, МассивОбработаноСегментов);
	ПоказатьОповещениеПользователя(
		НСтр("ru='Изменение:'"), ?(МассивОбработаноСегментов.Количество() = 1, СсылкаНаСегмент, ОповещениеСпискаСегментов),
		?(МассивОбработаноСегментов.Количество() = 1,Строка(МассивОбработаноСегментов[0]), СтрокаИзменено),
		БиблиотекаКартинок.Информация32);
		
	Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Если ТекущийШаг = 1 Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ВыборНоменклатуры;
	КонецЕсли;
	
	Если ТекущийШаг = 2 Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ВыборСегментов;
	КонецЕсли;
	
	Если ТекущийШаг = 1 Тогда
		Элементы.Шаг1.ЦветФона = ЦветТекущегоШага;
		Элементы.Шаг2.ЦветФона = ЦветШага;    
		Элементы.ПереходКоВторомуШагу.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.Шаг1.ЦветФона = ЦветШага;
		Элементы.Шаг2.ЦветФона = ЦветТекущегоШага; 
		Элементы.ЗавершитьВыбор.КнопкаПоУмолчанию = Истина;		
	КонецЕсли;
	
	Элементы.СтрокаСостоянияВыбораСегментыНоменклатуры.Заголовок = СтрокаСостоянияВыбораСегментов();

	ШаблонЗаголовок = НСтр("ru = 'Добавление номенклатуры в сегменты (Шаг %1/2)'");            
	СтрокаШаблон = СтрШаблон(ШаблонЗаголовок, ТекущийШаг);
	ЭтотОбъект.Заголовок = СтрокаШаблон;

КонецПроцедуры

&НаКлиенте
Функция СтрокаСостоянияВыбораСегментов()
	
	Если СегментыНоменклатуры.Количество() = 0 Тогда
		Возврат НСтр("ru ='Не выбрано ни одного сегмента'");
	КонецЕсли;
	
	СтрокаСостояния = "";  
	КоличествоСтрокНоменклатурыСПометкой = Номенклатура.НайтиСтроки(Новый Структура("Пометка",Истина)).Количество();
	Если КоличествоСтрокНоменклатурыСПометкой = 0 Тогда
		Возврат НСтр("ru ='Не выбрано ни одной номенклатуры'");
	КонецЕсли;

	СтрокаНоменклатура = СтрокаСЧислом(
		НСтр("ru=';Будет добавлена %1 номенклатурная позиция;;Будет добавлено %1 номенклатурных позиции;Будет добавлено %1 номенклатурных позиций;Будет добавлено %1 номенклатурных позиции'"),
		Строка(КоличествоСтрокНоменклатурыСПометкой),
		ВидЧисловогоЗначения.Количественное);
		
	СтрокаСегментов = СтрокаСЧислом(
		НСтр("ru=';в %1 сегмент;;в %1 сегмента;в %1 сегментов;в %1 сегмента'"),
		Строка(СегментыНоменклатуры.Количество()),
		ВидЧисловогоЗначения.Количественное);
		
	СтрокаСостояния = СтрокаНоменклатура + Символы.НПП + СтрокаСегментов;
	
	Возврат СтрокаСостояния;
	
КонецФункции  

&НаКлиенте
Процедура ОткрытьСписокСегментовПоОповещению(ДополнительныеПараметры) Экспорт

	ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Ссылка", ДополнительныеПараметры));
	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаСписка",ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателей(МассивНоменклатуры)
	
	Если ТипЗнч(МассивНоменклатуры) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.Ссылка В (&МассивНоменклатуры)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаНоменклатуры = Номенклатура.Добавить();
		СтрокаНоменклатуры.Пометка = Истина;
		СтрокаНоменклатуры.Значение = Выборка.Номенклатура;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруВСегменты(МассивОбработаноСегментов)
	
	УстановитьПривилегированныйРежим(Истина);	
	КоличествоДобавленнойНоменклатуры = 0;
	НоменклатураВыбранная = Номенклатура.Выгрузить(Новый Структура("Пометка",Истина)).ВыгрузитьКолонку("Значение");		
	Для Каждого СтрокаСегмент Из СегментыНоменклатуры Цикл
		
		Сегмент = СтрокаСегмент.Сегмент;
		РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаНоменклатуры(Сегмент);
		Если РазрешеноРедактированиеСегмента <> Истина Тогда  
			ТекстШаблона = НСтр("ru = 'Сегмент %1 используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
			СтрокаШаблон = СтрШаблон(ТекстШаблона, Сегмент);
			ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон);
        	Продолжить;
		КонецЕсли;   
		
		Если Не ЗначениеЗаполнено(Сегмент) Тогда
	   		Продолжить;
		КонецЕсли;		
		
		НачатьТранзакцию();
		
		Попытка  
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоставСегментаНоменклатуры");
			ЭлементБлокировки.УстановитьЗначение("Сегмент",Сегмент);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			Блокировка.Заблокировать();
			ОбъектСегмент = Сегмент.ПолучитьОбъект();
			ОбъектСегмент.Заблокировать();
			
			НоменклатураКДобавлению = ПолучитьМассивНоменклатурыКДобавлениюВСегмент(НоменклатураВыбранная,Сегмент);
            РегистрыСведений.СоставСегментаНоменклатуры.ОбновитьСоставВыбранногоСегментаВручную(Сегмент,НоменклатураКДобавлению);
					
			ОбъектСегмент.Разблокировать();
			МассивОбработаноСегментов.Добавить(Сегмент);
			ЗафиксироватьТранзакцию();
			
		Исключение                    
			
			ОтменитьТранзакцию();     			
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru = 'ДобавлениеНоменклатурыВСегменты'",ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
			УстановитьПривилегированныйРежим(Ложь);	
			ТекстСообщения = НСтр("ru='В процессе добавления номенклатуры в сегменты произошла следующая ошибка: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки);
			ВызватьИсключение ТекстСообщения;
			
		КонецПопытки;

				
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

&НаСервере
Процедура ВыборСегментаСервер(Знач ВыбранноеЗначение)
	
	Если (ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() = 0)
		ИЛИ (НЕ ЗначениеЗаполнено(ВыбранноеЗначение) И ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СегментыНоменклатуры")) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстШаблона = НСтр("ru = 'Сегмент %1 используется для предоставления скидки. Для редактирования состава сегмента обратитесь к администратору'");
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда
		
		СегментУжеВыбран = СегментыНоменклатуры.НайтиСтроки(Новый Структура("Сегмент", ВыбранноеЗначение));
		Если СегментУжеВыбран.Количество() <> 0 Тогда
			Возврат;
		КонецЕсли;  
		
		РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаНоменклатуры(ВыбранноеЗначение);
		Если РазрешеноРедактированиеСегмента <> Истина Тогда  
			СтрокаШаблон = СтрШаблон(ТекстШаблона, ВыбранноеЗначение);
			ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон);
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = СегментыНоменклатуры.Добавить();
		НоваяСтрока.Сегмент = ВыбранноеЗначение;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для Каждого Сегмент Из ВыбранноеЗначение Цикл
			СегментУжеВыбран = СегментыНоменклатуры.НайтиСтроки(Новый Структура("Сегмент", Сегмент));
			Если СегментУжеВыбран.Количество() <> 0 Тогда
				Возврат;
			КонецЕсли;
			
			РазрешеноРедактированиеСегмента = РаботаССегментами.РазрешеноРедактированиеСегментаНоменклатуры(Сегмент);
			Если РазрешеноРедактированиеСегмента <> Истина Тогда
				СтрокаШаблон = СтрШаблон(ТекстШаблона, Сегмент);
				ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон);
				Возврат;
			КонецЕсли;  
			
			НоваяСтрока = СегментыНоменклатуры.Добавить();
			НоваяСтрока.Сегмент = Сегмент;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивНоменклатурыКДобавлениюВСегмент(НоменклатураВыбранная,Сегмент)
	
	// АПК:96-выкл В данном случае требуется получить именно различную номенклатуру без пересечений из двух источников
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ   
	|	СправочникНоменклатура.Ссылка <> Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	И СправочникНоменклатура.Ссылка В (&МассивНоменклатуры)  
	|
    |ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СоставСегментаНоменклатуры.Номенклатура,
	|	СоставСегментаНоменклатуры.Характеристика
	|ИЗ
	|	РегистрСведений.СоставСегментаНоменклатуры КАК СоставСегментаНоменклатуры
	|ГДЕ
	|	СоставСегментаНоменклатуры.Сегмент = &Сегмент
	|	И СоставСегментаНоменклатуры.СпособДобавления = &СпособДобавления";
	// АПК:96-вкл
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", НоменклатураВыбранная);
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	Запрос.УстановитьПараметр("СпособДобавления", Перечисления.СпособыДобавленияВСегмент.Вручную);  
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПроверитьДоступностьСегмента(Знач Сегмент)
		
    Возврат РаботаССегментами.РазрешеноРедактированиеСегментаНоменклатуры(Сегмент);
	
КонецФункции	

#КонецОбласти
